In [2]:
%reload_ext sql

#to check sql_queries.py
#%run sql_queries.py

#to check create_tables.py
#%run create_tables.py

In [3]:
%sql postgresql://student:student@127.0.0.1/sparkifydb

'Connected: student@sparkifydb'

In [4]:
%sql SELECT * FROM songplays LIMIT 5; 

#%sql SELECT count(1) FROM songplays; #count = 7150

 * postgresql://student:***@127.0.0.1/sparkifydb
5 rows affected.

[(1, datetime.datetime(2018, 11, 30, 0, 22, 7, 796000), 91, 'free', None, None, 829, 'Dallas-Fort Worth-Arlington, TX', 'Mozilla/5.0 (compatible; MSIE 10.0; Windows NT 6.2; WOW64; Trident/6.0)'),
 (2, datetime.datetime(2018, 11, 30, 1, 8, 41, 796000), 73, 'paid', None, None, 1049, 'Tampa-St. Petersburg-Clearwater, FL', '"Mozilla/5.0 (Macintosh; Intel Mac OS X 10_9_4) AppleWebKit/537.78.2 (KHTML, like Gecko) Version/7.0.6 Safari/537.78.2"'),
 (3, datetime.datetime(2018, 11, 30, 1, 12, 48, 796000), 73, 'paid', None, None, 1049, 'Tampa-St. Petersburg-Clearwater, FL', '"Mozilla/5.0 (Macintosh; Intel Mac OS X 10_9_4) AppleWebKit/537.78.2 (KHTML, like Gecko) Version/7.0.6 Safari/537.78.2"'),
 (4, datetime.datetime(2018, 11, 30, 1, 17, 5, 796000), 73, 'paid', None, None, 1049, 'Tampa-St. Petersburg-Clearwater, FL', '"Mozilla/5.0 (Macintosh; Intel Mac OS X 10_9_4) AppleWebKit/537.78.2 (KHTML, like Gecko) Version/7.0.6 Safari/537.78.2"'),
 (5, datetime.datetime(2018, 11, 30, 1, 20, 56, 796000), 73, 'paid', None, None, 1049, 'Tampa-St. Petersburg-Clearwater, FL', '"Mozilla/5.0 (Macintosh; Intel Mac OS X 10_9_4) AppleWebKit/537.78.2 (KHTML, like Gecko) Version/7.0.6 Safari/537.78.2"')]

In [13]:
%sql SELECT * FROM users LIMIT 5;

#%sql SELECT count(1) FROM users; #count = 96

 * postgresql://student:***@127.0.0.1/sparkifydb
5 rows affected.

[(91, 'Jayden', 'Bell', 'M', 'free'),
 (73, 'Jacob', 'Klein', 'M', 'paid'),
 (86, 'Aiden', 'Hess', 'M', 'free'),
 (24, 'Layla', 'Griffin', 'F', 'paid'),
 (26, 'Ryan', 'Smith', 'M', 'free')]

In [4]:
%sql SELECT * FROM songs LIMIT 5;

#%sql SELECT count(1) FROM songs; #count = 71

 * postgresql://student:***@127.0.0.1/sparkifydb
5 rows affected.

[('SOMZWCG12A8C13C480', "I Didn't Mean To", 'ARD7TVE1187B99BFB1', 0, 218.93179),
 ('SOUDSGM12AC9618304', 'Insatiable (Instrumental Version)', 'ARNTLGG11E2835DDB9', 0, 266.39628),
 ('SOIAZJW12AB01853F1', 'Pink World', 'AR8ZCNI1187B9A069B', 1984, 269.81832),
 ('SOHKNRJ12A6701D1F8', 'Drop of Rain', 'AR10USD1187B99F3F1', 0, 189.57016),
 ('SOCIWDW12A8C13D406', 'Soul Deep', 'ARMJAGH1187FB546F3', 1969, 148.03546)]

In [7]:
%sql SELECT * FROM artists LIMIT 5;

#%sql SELECT count(1) FROM artists ;#count = 69

 * postgresql://student:***@127.0.0.1/sparkifydb
0 rows affected.

[]

In [20]:
%sql SELECT * FROM time LIMIT 5;

#%sql SELECT count(1) FROM time; #count = 6813

#To check songsdata query
%sql Select  songs.song_id, songs.artist_id from songs JOIN artists a ON songs.artist_id = a.artist_id LIMIT 5;

 * postgresql://student:***@127.0.0.1/sparkifydb
5 rows affected.
 * postgresql://student:***@127.0.0.1/sparkifydb
5 rows affected.

[('SOMZWCG12A8C13C480', 'ARD7TVE1187B99BFB1'),
 ('SOUDSGM12AC9618304', 'ARNTLGG11E2835DDB9'),
 ('SOIAZJW12AB01853F1', 'AR8ZCNI1187B9A069B'),
 ('SOHKNRJ12A6701D1F8', 'AR10USD1187B99F3F1'),
 ('SOCIWDW12A8C13D406', 'ARMJAGH1187FB546F3')]

## REMEMBER: Restart this notebook to close connection to `sparkifydb`
Each time you run the cells above, remember to restart this notebook to close the connection to your database. Otherwise, you won't be able to run your code in `create_tables.py`, `etl.py`, or `etl.ipynb` files since you can't make multiple connections to the same database (in this case, sparkifydb).

In [10]:
#To check etl.py 
%run etl.py

80 files found in data/song_data
1/80 files processed.
2/80 files processed.
3/80 files processed.
4/80 files processed.
5/80 files processed.
6/80 files processed.
7/80 files processed.
8/80 files processed.
9/80 files processed.
10/80 files processed.
11/80 files processed.
12/80 files processed.
13/80 files processed.
14/80 files processed.
15/80 files processed.
16/80 files processed.
17/80 files processed.
18/80 files processed.
19/80 files processed.
20/80 files processed.
21/80 files processed.
22/80 files processed.
23/80 files processed.
24/80 files processed.
25/80 files processed.
26/80 files processed.
27/80 files processed.
28/80 files processed.
29/80 files processed.
30/80 files processed.
31/80 files processed.
32/80 files processed.
33/80 files processed.
34/80 files processed.
35/80 files processed.
36/80 files processed.
37/80 files processed.
38/80 files processed.
39/80 files processed.
40/80 files processed.
41/80 files processed.
42/80 files processed.
43/80 files processed.
44/80 files processed.
45/80 files processed.
46/80 files processed.
47/80 files processed.
48/80 files processed.
49/80 files processed.
50/80 files processed.
51/80 files processed.
52/80 files processed.
53/80 files processed.
54/80 files processed.
55/80 files processed.
56/80 files processed.
57/80 files processed.
58/80 files processed.
59/80 files processed.
60/80 files processed.
61/80 files processed.
62/80 files processed.
63/80 files processed.
64/80 files processed.
65/80 files processed.
66/80 files processed.
67/80 files processed.
68/80 files processed.
69/80 files processed.
70/80 files processed.
71/80 files processed.
72/80 files processed.
73/80 files processed.
74/80 files processed.
75/80 files processed.
76/80 files processed.
77/80 files processed.
78/80 files processed.
79/80 files processed.
80/80 files processed.
30 files found in data/log_data
1/30 files processed.
2/30 files processed.
3/30 files processed.
4/30 files processed.
5/30 files processed.
6/30 files processed.
7/30 files processed.
8/30 files processed.
9/30 files processed.
10/30 files processed.
11/30 files processed.
12/30 files processed.
13/30 files processed.
14/30 files processed.
15/30 files processed.
16/30 files processed.
17/30 files processed.
18/30 files processed.
19/30 files processed.
20/30 files processed.
21/30 files processed.
22/30 files processed.
23/30 files processed.
24/30 files processed.
25/30 files processed.
26/30 files processed.
27/30 files processed.
28/30 files processed.
29/30 files processed.
30/30 files processed.

In [5]:
#TO check analytics query
%sql Select distinct * from songplays sp join users u on (sp.user_id = u.user_id) join songs s on (sp.song_id= s.song_id) join  artists a on (sp.artist_id=a.artist_id) join time t on (sp.start_time = t.start_time) LIMIT 5;

 * postgresql://student:***@127.0.0.1/sparkifydb
1 rows affected.

[(4108, datetime.datetime(2018, 11, 21, 21, 56, 47, 796000), 15, 'paid', 'SOZCTXZ12AB0182364', 'AR5KOSW1187FB35FF4', 818, 'Chicago-Naperville-Elgin, IL-IN-WI', '"Mozilla/5.0 (X11; Linux x86_64) AppleWebKit/537.36 (KHTML, like Gecko) Ubuntu Chromium/36.0.1985.125 Chrome/36.0.1985.125 Safari/537.36"', 15, 'Lily', 'Koch', 'F', 'paid', 'SOZCTXZ12AB0182364', 'Setanta matins', 'AR5KOSW1187FB35FF4', 0, 269.58322, 'AR5KOSW1187FB35FF4', 'Elena', 'Dubai UAE', 49.80388, 15.47491, datetime.datetime(2018, 11, 21, 21, 56, 47, 796000), 21, 21, 47, 11, 2018, 2)]